FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_GPDMA.c
/*-------------------------------------------------------------------------*
 * File:  GPDMA.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC546xx GP DMA controller.
 * Implementation:
 *
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(R) to your own hardware!  |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <Config.h>
#include <stddef.h>
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <HAL/Interrupt.h>
#include <Source/Processor/NXP/LPC546xx/LPC546xx_GPDMA.h>

// TBD:  not here!
#include <uEZRTOS.h>

/*-------------------------------------------------------------------------*
 * Defines:
 *-------------------------------------------------------------------------*/
#define INTERRUPT_CHANNEL_GP_DMA                            DMA_IRQn

#define GPDMA_FLOW_CONTROL_DMA_CONTROLLER                   (0<<2)
#define GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER            (1<<2)
#define GPDMA_FLOW_CONTROL_SOURCE_IS_MEMORY                 (0<<1)
#define GPDMA_FLOW_CONTROL_SOURCE_IS_PERIPHERAL             (1<<1)
#define GPDMA_FLOW_CONTROL_DESTINATION_IS_MEMORY            (0<<0)
#define GPDMA_FLOW_CONTROL_DESTINATION_IS_PERIPHERAL        (1<<0)

#define GPDMA_CHANNEL0 0
#define GPDMA_CHANNEL1 1
#define GPDMA_CHANNEL2 2
#define GPDMA_CHANNEL3 3
#define GPDMA_CHANNEL4 4
#define GPDMA_CHANNEL5 5
#define GPDMA_CHANNEL6 6
#define GPDMA_CHANNEL7 7

#define DMACCConfiguration_FlowCntrl_BIT    11
#define DMACCConfiguration_OFFSET 0x110
#define DMACCConfiguration_E_MASK 0x1
#define DMACCConfiguration_E 0x1
#define DMACCConfiguration_E_BIT 0
#define DMACCConfiguration_SrcPeripheral_MASK 0x1E
#define DMACCConfiguration_SrcPeripheral_BIT 1
#define DMACCConfiguration_DestPeripheral_MASK 0x3C0
#define DMACCConfiguration_DestPeripheral_BIT 6
#define DMACCConfiguration_FlowCntrl_MASK 0x3800
#define DMACCConfiguration_FlowCntrl_BIT 11
#define DMACCConfiguration_IE_MASK 0x4000
#define DMACCConfiguration_IE 0x4000
#define DMACCConfiguration_IE_BIT 14
#define DMACCConfiguration_ITC_MASK 0x8000
#define DMACCConfiguration_ITC 0x8000
#define DMACCConfiguration_ITC_BIT 15
#define DMACCConfiguration_L_MASK 0x10000
#define DMACCConfiguration_L 0x10000
#define DMACCConfiguration_L_BIT 16
#define DMACCConfiguration_A_MASK 0x20000
#define DMACCConfiguration_A 0x20000
#define DMACCConfiguration_A_BIT 17
#define DMACCConfiguration_H_MASK 0x40000
#define DMACCConfiguration_H 0x40000
#define DMACCConfiguration_H_BIT 18

#define DMACCControl_TransferSize_MASK 0xFFF
#define DMACCControl_TransferSize_BIT 0
#define DMACCControl_Prot_MASK 0x70000000
#define DMACCControl_Prot_BIT 28

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    const HAL_GPDMA *iHAL;
    // Control word for DMA channel
    TUInt32 iControl;

    // Configuration word for DMA channel
    TUInt32 iConfiguration;

    // source address
    TUInt32 iSource;

    // destination address
    TUInt32 iDestination;

    // address of linked list
    TUInt32 iLinkedList;

    // gpdma iChannel
    TUInt8 iChannel;

    TUInt32 iSourcePeripheral;
    TUInt32 iDestinationPeripheral;

    // ISR hook function
    T_gpdmaCallback iISRCallback;
    void *iISRCallbackWorkspace;
} T_LPC546xx_GPDMA_Workspace;

/*---------------------------------------------------------------------------*
 * Forward declaration:
 *---------------------------------------------------------------------------*/
static void LPC546xx_GPDMA_Enable(void *aWorkspace);
/*static void LPC546xx_GPDMA_Disable(void *aWorkspace);*/
static TBool LPC546xx_GPDMA_ChannelIsEnabled(void *aWorkspace);
static void IGPDMAProcessInterrupt(T_LPC546xx_GPDMA_Workspace *p);
IRQ_ROUTINE( IGPDMA)
;

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
#define GPDMA_PERIPHERAL_PRIMARY          0x0000
#define GPDMA_PERIPHERAL_SECONDARY        0x8000
#define GPDMA_PERIPHERAL_MASK             0x7FFF
const TUInt32 G_peripheralMap[GPDMA_PERIPHERAL_UART4_RX + 1] = {
    GPDMA_PERIPHERAL_PRIMARY | 2,  //#define GPDMA_PERIPHERAL_SSP0_TX        0
    GPDMA_PERIPHERAL_PRIMARY | 3,  //#define GPDMA_PERIPHERAL_SSP0_RX        1
    GPDMA_PERIPHERAL_PRIMARY | 4,  //#define GPDMA_PERIPHERAL_SSP1_TX        2
    GPDMA_PERIPHERAL_PRIMARY | 5,  //#define GPDMA_PERIPHERAL_SSP1_RX        3
    GPDMA_PERIPHERAL_PRIMARY | 1,  //#define GPDMA_PERIPHERAL_SD_MMC         4
    GPDMA_PERIPHERAL_SECONDARY | 6,  //#define GPDMA_PERIPHERAL_I2S0           5
    GPDMA_PERIPHERAL_SECONDARY | 7,  //#define GPDMA_PERIPHERAL_I2S1           6
    GPDMA_PERIPHERAL_PRIMARY | 6,  //#define GPDMA_PERIPHERAL_SSP2_TX        7
    GPDMA_PERIPHERAL_PRIMARY | 7,  //#define GPDMA_PERIPHERAL_SSP2_RX        8
    GPDMA_PERIPHERAL_PRIMARY | 10, //#define GPDMA_PERIPHERAL_UART0_TX       9
    GPDMA_PERIPHERAL_PRIMARY | 11, //#define GPDMA_PERIPHERAL_UART0_RX       10
    GPDMA_PERIPHERAL_PRIMARY | 12, //#define GPDMA_PERIPHERAL_UART1_TX       11
    GPDMA_PERIPHERAL_PRIMARY | 13, //#define GPDMA_PERIPHERAL_UART1_RX       12
    GPDMA_PERIPHERAL_PRIMARY | 14, //#define GPDMA_PERIPHERAL_UART2_TX       13
    GPDMA_PERIPHERAL_PRIMARY | 15, //#define GPDMA_PERIPHERAL_UART2_RX       14
    GPDMA_PERIPHERAL_PRIMARY | 8,  //#define GPDMA_PERIPHERAL_ADC            15
    GPDMA_PERIPHERAL_PRIMARY | 9,  //#define GPDMA_PERIPHERAL_DAC            16
    GPDMA_PERIPHERAL_SECONDARY | 0, //#define GPDMA_PERIPHERAL_TIMER0_MAT0    17
    GPDMA_PERIPHERAL_SECONDARY | 1, //#define GPDMA_PERIPHERAL_TIMER0_MAT1    18
    GPDMA_PERIPHERAL_SECONDARY | 2, //#define GPDMA_PERIPHERAL_TIMER1_MAT0    19
    GPDMA_PERIPHERAL_SECONDARY | 3, //#define GPDMA_PERIPHERAL_TIMER1_MAT1    20
    GPDMA_PERIPHERAL_SECONDARY | 4, //#define GPDMA_PERIPHERAL_TIMER2_MAT0    21
    GPDMA_PERIPHERAL_SECONDARY | 5, //#define GPDMA_PERIPHERAL_TIMER2_MAT1    22
    GPDMA_PERIPHERAL_SECONDARY | 14, //#define GPDMA_PERIPHERAL_TIMER3_MAT0    23
    GPDMA_PERIPHERAL_SECONDARY | 15, //#define GPDMA_PERIPHERAL_TIMER3_MAT1    24
    GPDMA_PERIPHERAL_SECONDARY | 10, //#define GPDMA_PERIPHERAL_UART3_TX       27
    GPDMA_PERIPHERAL_SECONDARY | 11, //#define GPDMA_PERIPHERAL_UART3_RX       28
    GPDMA_PERIPHERAL_SECONDARY | 12, //#define GPDMA_PERIPHERAL_UART4_TX       29
    GPDMA_PERIPHERAL_SECONDARY | 13, //#define GPDMA_PERIPHERAL_UART4_RX       30
    };

/*---------------------------------------------------------------------------*
 * Static global variables:
 *---------------------------------------------------------------------------*/

typedef struct                          /* Channel Registers                  */
{
  __IO uint32_t CSrcAddr;                   /*!< Offset: 0x000 (R/W)  DMA Channel # Source Address Register */
  __IO uint32_t CDestAddr;                  /*!< Offset: 0x004 (R/W)  DMA Channel # Destination Address Register */
  __IO uint32_t CLLI;                       /*!< Offset: 0x008 (R/W)  DMA Channel # Linked List Item Register */
  __IO uint32_t CControl;                   /*!< Offset: 0x00C (R/W)  DMA Channel # Control Register */
  __IO uint32_t CConfig;                    /*!< Offset: 0x010 (R/W)  DMA Channel # Configuration Register */
} LPC_GPDMACH_TypeDef;

// Number of G_opened dma channels.
static TUInt8 G_opened = 0;
static LPC_GPDMACH_TypeDef * const G_channelRegs[8] = {
    (LPC_GPDMACH_TypeDef *)&LPC_GPDMA->C0SRCADDR,
    (LPC_GPDMACH_TypeDef *)&LPC_GPDMA->C1SRCADDR,
    (LPC_GPDMACH_TypeDef *)&LPC_GPDMA->C2SRCADDR,
    (LPC_GPDMACH_TypeDef *)&LPC_GPDMA->C3SRCADDR,
    (LPC_GPDMACH_TypeDef *)&LPC_GPDMA->C4SRCADDR,
    (LPC_GPDMACH_TypeDef *)&LPC_GPDMA->C5SRCADDR,
    (LPC_GPDMACH_TypeDef *)&LPC_GPDMA->C6SRCADDR,
    (LPC_GPDMACH_TypeDef *)&LPC_GPDMA->C7SRCADDR,
};

static T_LPC546xx_GPDMA_Workspace * G_workspaceGPDMAChannel[8];

T_uezError LPC546xx_GPDMA_InitializeWorkspace_ChannelX(
    void *aWorkspace,
    TUInt8 aChannel)
{
    T_LPC546xx_GPDMA_Workspace *p = (T_LPC546xx_GPDMA_Workspace *)aWorkspace;

    // Setup GPDMA peripheral
    LPC546xx_GPDMA_Enable(aWorkspace);

    // channel X
    p->iChannel = aChannel;

    // Fill the structure with default value for control and attributes.
    p->iControl = 0;
    p->iISRCallback = 0;
    p->iLinkedList = 0;
    p->iSource = 0;
    p->iDestination = 0;

