FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_GPDMA.c
    T_LPC546xx_GPDMA_Workspace *p = (T_LPC546xx_GPDMA_Workspace *)aWorkspace;

    // Load the destination & source address into the iControl block.
    // (Note: These only apply to memory transfers)
    p->iSource = (TUInt32)aRequest->iSourceAddr;
    p->iDestination = (TUInt32)aRequest->iDestinationAddr;

    // Load the iControl word.
    control = aRequest->iControl;

    // Channel 0 and 1 have the same defines, so only iChannel 0 is used.

    // Set the transfer size and mode in the iControl word.
    control |= (aRequest->iNumTransferItems << DMACCControl_TransferSize_BIT)
        & DMACCControl_TransferSize_MASK;

    // DMA Scatter-Gather?
    p->iLinkedList = (TUInt32)aRequest->iLinkedList;

    // Callback for DMA end or error?
    p->iISRCallback = aISRCallback;
    p->iISRCallbackWorkspace = aISRCallbackWorkspace;
    if (aISRCallback)
        control |= GPDMA_INT_ENABLE;

    // Bufferable and Cacheable. 0b110.
    control |= (0x6 << DMACCControl_Prot_BIT) & DMACCControl_Prot_MASK;

    // Store iControl value.
    p->iControl = control;

    // Flow control is to be determined by the various types
    // General output to match Table 675 from UM102347: LPC546xx user's manual
    flow = 0;
    p->iSourcePeripheral = aRequest->iSourcePeripheral;
    p->iDestinationPeripheral = aRequest->iDestinationPeripheral;

    if (aRequest->iSourcePeripheral != GPDMA_PERIPHERAL_MEMORY)
        flow |= GPDMA_FLOW_CONTROL_SOURCE_IS_PERIPHERAL;
    if (aRequest->iDestinationPeripheral != GPDMA_PERIPHERAL_MEMORY)
        flow |= GPDMA_FLOW_CONTROL_DESTINATION_IS_PERIPHERAL;

    if (aRequest->iFlowControl == GPDMA_FLOW_CONTROL_DMA) {
        flow |= GPDMA_FLOW_CONTROL_DMA_CONTROLLER;
    } else if (aRequest->iFlowControl == GPDMA_FLOW_CONTROL_SOURCE_PERIPHERAL) {
        flow |= GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
    } else if (aRequest->iFlowControl
        == GPDMA_FLOW_CONTROL_DESTINATION_PERIPHERAL) {
        if (aRequest->iSourcePeripheral != GPDMA_PERIPHERAL_MEMORY)
            flow = GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
        else
            flow |= GPDMA_FLOW_CONTROL_PERIPHERAL_CONTROLLER;
    }

    // Setup flow control
    p->iConfiguration = ((flow << DMACCConfiguration_FlowCntrl_BIT)
        & DMACCConfiguration_FlowCntrl_MASK) | DMACCConfiguration_E;

    // If the callback is set, process interrupts.
    if (aISRCallback)
        p->iConfiguration |= DMACCConfiguration_IE | DMACCConfiguration_ITC;

    // If the source is a peripheral, configure the type
    if (aRequest->iSourcePeripheral != GPDMA_PERIPHERAL_MEMORY) {
        perip = IPeripheralToIndex(aRequest->iSourcePeripheral);
        if (perip == GPDMA_PERIPHERAL_UNKNOWN)
            return UEZ_ERROR_INVALID_PARAMETER;
        p->iConfiguration |= ((perip << DMACCConfiguration_SrcPeripheral_BIT)
            & DMACCConfiguration_SrcPeripheral_MASK);
    }

    // If the destination is a peripheral, configure the type
    if (aRequest->iDestinationPeripheral != GPDMA_PERIPHERAL_MEMORY) {
        perip = IPeripheralToIndex(aRequest->iDestinationPeripheral);
        if (perip == GPDMA_PERIPHERAL_UNKNOWN)
            return UEZ_ERROR_INVALID_PARAMETER;
        p->iConfiguration |= ((perip << DMACCConfiguration_DestPeripheral_BIT)
            & DMACCConfiguration_DestPeripheral_MASK);
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPDMA_BurstRequest
 *---------------------------------------------------------------------------*
 * Description:
 *      Generate a GPDMA Burst Request for the given peripheral
 * Inputs:
 *      void *aWorkspace                -- Particular GPDMA workspace
 *      T_gpdmaPeripheral aPeripheral   -- Peripheral to handle request
 * Outputs:
 *      T_uezError                  -- Error code, UEZ_ERROR_NOT_FOUND
 *                                      if peripheral not supported.
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPDMA_BurstRequest(
    void *aWorkspace,
    T_gpdmaPeripheral aPeripheral)
{
    TUInt32 b;
    PARAM_NOT_USED(aWorkspace);

    b = IPeripheralToIndex(aPeripheral);
    if (b == GPDMA_PERIPHERAL_UNKNOWN)
        return UEZ_ERROR_NOT_FOUND;
    LPC_GPDMA->SOFTBREQ = (1<<b);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPDMA_SingleRequest
 *---------------------------------------------------------------------------*
 * Description:
 *      Generate a GPDMA Single Request for the given peripheral
 * Inputs:
 *      void *aWorkspace                -- Particular GPDMA workspace
 *      T_gpdmaPeripheral aPeripheral   -- Peripheral to handle request
 * Outputs:
 *      T_uezError                  -- Error code, UEZ_ERROR_NOT_FOUND
 *                                      if peripheral not supported.
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPDMA_SingleRequest(
    void *aWorkspace,
    T_gpdmaPeripheral aPeripheral)
{
    TUInt32 b;
    PARAM_NOT_USED(aWorkspace);

    b = IPeripheralToIndex(aPeripheral);
    if (b == GPDMA_PERIPHERAL_UNKNOWN)
        return UEZ_ERROR_NOT_FOUND;
    LPC_GPDMA->SOFTSREQ = (1<<b);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPDMA_LastBurstRequest
 *---------------------------------------------------------------------------*
 * Description:
 *      Generate a GPDMA Last Burst Request for the given peripheral
 * Inputs:
 *      void *aWorkspace                -- Particular GPDMA workspace
 *      T_gpdmaPeripheral aPeripheral   -- Peripheral to handle request
 * Outputs:
 *      T_uezError                  -- Error code, UEZ_ERROR_NOT_FOUND
 *                                      if peripheral not supported.
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPDMA_LastBurstRequest(
    void *aWorkspace,
    T_gpdmaPeripheral aPeripheral)
{
    TUInt32 b;
    PARAM_NOT_USED(aWorkspace);

    b = IPeripheralToIndex(aPeripheral);
    if (b == GPDMA_PERIPHERAL_UNKNOWN)
        return UEZ_ERROR_NOT_FOUND;
    LPC_GPDMA->SOFTLBREQ = (1<<b);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPDMA_LastSingleRequest
 *---------------------------------------------------------------------------*
 * Description:
 *      Generate a GPDMA Last Single Request for the given peripheral
 * Inputs:
 *      void *aWorkspace                -- Particular GPDMA workspace
 *      T_gpdmaPeripheral aPeripheral   -- Peripheral to handle request
 * Outputs:
 *      T_uezError                  -- Error code, UEZ_ERROR_NOT_FOUND
 *                                      if peripheral not supported.
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_GPDMA_LastSingleRequest(
    void *aWorkspace,
    T_gpdmaPeripheral aPeripheral)
{
    TUInt32 b;
    PARAM_NOT_USED(aWorkspace);

    b = IPeripheralToIndex(aPeripheral);
    if (b == GPDMA_PERIPHERAL_UNKNOWN)
        return UEZ_ERROR_NOT_FOUND;
    LPC_GPDMA->SOFTLSREQ = (1<<b);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_GPDMA_IsValidAddress
 *---------------------------------------------------------------------------*
 * Description:
 *      Determine if the GPDMA is valid
 * Inputs:
 *      TUInt32 aAddr               -- Address to check if GPDMA works here
 * Outputs:
 *      TBool                       -- ETrue if valid, else EFalse
 *---------------------------------------------------------------------------*/
static TBool LPC546xx_GPDMA_IsValidAddress(TUInt32 aAddr)
{
    // On the LPC546xx, all addresses are valid
    return ETrue;
}

/*---------------------------------------------------------------------------*
 * Routine:  IGPDMAProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Generic routine for handling any of the dma channels (as passed
 *      into the routine.
 *      NOTE:  This routine is ALWAYS processed inside of a interrupt
 *              service routine.
 * Inputs:
 *      T_LPC546xx_GPDMA_Workspace *p      -- Port's definition to process interrupt
 *---------------------------------------------------------------------------*/
static void IGPDMAProcessInterrupt(T_LPC546xx_GPDMA_Workspace *p)
{
    T_gpdmaState state = GPDMA_UNKNOWN;

